---
kind: type
id: T:Autodesk.Revit.DB.Workset
zh: 工作集
source: html/aa8f7f05-16c7-2fbf-5004-d819a1fd0b6d.htm
---
# Autodesk.Revit.DB.Workset

**中文**: 工作集

Represents a workset in the document.

## Syntax (C#)
```csharp
public class Workset : WorksetPreview
```

## Remarks
Worksets are a way to divide a set of elements in the Revit document into subsets for worksharing.
 There may be one or many worksets in a document.
 Each element in the document must belong to one and only one workset.